FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52_erratas.h
/* ========= Errata 1 ========= */
#if    defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
    #define NRF52_ERRATA_1_PRESENT    1
#else
    #define NRF52_ERRATA_1_PRESENT    0
#endif

#ifndef NRF52_ERRATA_1_ENABLE_WORKAROUND
    #define NRF52_ERRATA_1_ENABLE_WORKAROUND    NRF52_ERRATA_1_PRESENT
#endif

static bool nrf52_errata_1( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    case 0x06ul:
                        return false;

                    case 0x07ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 2 ========= */
#if    defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
    #define NRF52_ERRATA_2_PRESENT    1
#else
    #define NRF52_ERRATA_2_PRESENT    0
#endif

#ifndef NRF52_ERRATA_2_ENABLE_WORKAROUND
    #define NRF52_ERRATA_2_ENABLE_WORKAROUND    NRF52_ERRATA_2_PRESENT
#endif

static bool nrf52_errata_2( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    case 0x06ul:
                        return false;

                    case 0x07ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 3 ========= */
#if    defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
    #define NRF52_ERRATA_3_PRESENT    1
#else
    #define NRF52_ERRATA_3_PRESENT    0
#endif

#ifndef NRF52_ERRATA_3_ENABLE_WORKAROUND
    #define NRF52_ERRATA_3_ENABLE_WORKAROUND    NRF52_ERRATA_3_PRESENT
#endif

static bool nrf52_errata_3( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    case 0x06ul:
                        return false;

                    case 0x07ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 4 ========= */
#if    defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
    #define NRF52_ERRATA_4_PRESENT    1
#else
    #define NRF52_ERRATA_4_PRESENT    0
#endif

#ifndef NRF52_ERRATA_4_ENABLE_WORKAROUND
    #define NRF52_ERRATA_4_ENABLE_WORKAROUND    NRF52_ERRATA_4_PRESENT
#endif

static bool nrf52_errata_4( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return false;

