FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52_erratas.h
/* ========= Errata 75 ========= */
#if    defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
    #define NRF52_ERRATA_75_PRESENT    1
#else
    #define NRF52_ERRATA_75_PRESENT    0
#endif

#ifndef NRF52_ERRATA_75_ENABLE_WORKAROUND
    #define NRF52_ERRATA_75_ENABLE_WORKAROUND    NRF52_ERRATA_75_PRESENT
#endif

static bool nrf52_errata_75( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1;
            uint32_t var2;

            if( *( uint32_t * ) 0x10000130ul == 0xFFFFFFFF )
            {
                var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
                var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
            }
            else
            {
                var1 = *( uint32_t * ) 0x10000130ul;
                var2 = *( uint32_t * ) 0x10000134ul;
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    case 0x06ul:
                        return true;

                    case 0x07ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 76 ========= */
#if    defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
    #define NRF52_ERRATA_76_PRESENT    1
#else
    #define NRF52_ERRATA_76_PRESENT    0
#endif

#ifndef NRF52_ERRATA_76_ENABLE_WORKAROUND
    #define NRF52_ERRATA_76_ENABLE_WORKAROUND    NRF52_ERRATA_76_PRESENT
#endif

static bool nrf52_errata_76( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1;
            uint32_t var2;

            if( *( uint32_t * ) 0x10000130ul == 0xFFFFFFFF )
            {
                var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
                var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
            }
            else
            {
                var1 = *( uint32_t * ) 0x10000130ul;
                var2 = *( uint32_t * ) 0x10000134ul;
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    case 0x06ul:
                        return true;

                    case 0x07ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 77 ========= */
#if    defined( NRF52805_XXAA ) || defined( DEVELOP_IN_NRF52805 ) \
    || defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 ) \
    || defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 ) \
    || defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
    #define NRF52_ERRATA_77_PRESENT    1
#else
    #define NRF52_ERRATA_77_PRESENT    0
#endif

#ifndef NRF52_ERRATA_77_ENABLE_WORKAROUND
    #define NRF52_ERRATA_77_ENABLE_WORKAROUND    NRF52_ERRATA_77_PRESENT
#endif

static bool nrf52_errata_77( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1;
            uint32_t var2;

            if( *( uint32_t * ) 0x10000130ul == 0xFFFFFFFF )
            {
                var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
                var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
            }
            else
            {
                var1 = *( uint32_t * ) 0x10000130ul;
                var2 = *( uint32_t * ) 0x10000134ul;
            }
        #elif defined( NRF52805_XXAA ) || defined( DEVELOP_IN_NRF52805 ) \
        || defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 )    \
        || defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return true;

