FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52_erratas.h
                    case 0x05ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 120 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_120_PRESENT    1
#else
    #define NRF52_ERRATA_120_PRESENT    0
#endif

#ifndef NRF52_ERRATA_120_ENABLE_WORKAROUND
    #define NRF52_ERRATA_120_ENABLE_WORKAROUND    NRF52_ERRATA_120_PRESENT
#endif

static bool nrf52_errata_120( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 121 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_121_PRESENT    1
#else
    #define NRF52_ERRATA_121_PRESENT    0
#endif

#ifndef NRF52_ERRATA_121_ENABLE_WORKAROUND
    #define NRF52_ERRATA_121_ENABLE_WORKAROUND    NRF52_ERRATA_121_PRESENT
#endif

static bool nrf52_errata_121( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 122 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_122_PRESENT    1
#else
    #define NRF52_ERRATA_122_PRESENT    0
#endif

#ifndef NRF52_ERRATA_122_ENABLE_WORKAROUND
    #define NRF52_ERRATA_122_ENABLE_WORKAROUND    NRF52_ERRATA_122_PRESENT
#endif

static bool nrf52_errata_122( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 127 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_127_PRESENT    1
#else
    #define NRF52_ERRATA_127_PRESENT    0
#endif

#ifndef NRF52_ERRATA_127_ENABLE_WORKAROUND
    #define NRF52_ERRATA_127_ENABLE_WORKAROUND    NRF52_ERRATA_127_PRESENT
#endif

static bool nrf52_errata_127( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 128 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_128_PRESENT    1
#else
    #define NRF52_ERRATA_128_PRESENT    0
#endif

#ifndef NRF52_ERRATA_128_ENABLE_WORKAROUND
    #define NRF52_ERRATA_128_ENABLE_WORKAROUND    NRF52_ERRATA_128_PRESENT
#endif

static bool nrf52_errata_128( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

