FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52_erratas.h
                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 131 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_131_PRESENT    1
#else
    #define NRF52_ERRATA_131_PRESENT    0
#endif

#ifndef NRF52_ERRATA_131_ENABLE_WORKAROUND
    #define NRF52_ERRATA_131_ENABLE_WORKAROUND    NRF52_ERRATA_131_PRESENT
#endif

static bool nrf52_errata_131( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 132 ========= */
#if    defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
    #define NRF52_ERRATA_132_PRESENT    1
#else
    #define NRF52_ERRATA_132_PRESENT    0
#endif

#ifndef NRF52_ERRATA_132_ENABLE_WORKAROUND
    #define NRF52_ERRATA_132_ENABLE_WORKAROUND    NRF52_ERRATA_132_PRESENT
#endif

static bool nrf52_errata_132( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1;
            uint32_t var2;

            if( *( uint32_t * ) 0x10000130ul == 0xFFFFFFFF )
            {
                var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
                var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
            }
            else
            {
                var1 = *( uint32_t * ) 0x10000130ul;
                var2 = *( uint32_t * ) 0x10000134ul;
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return true;

                    case 0x06ul:
                        return true;

                    case 0x07ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 133 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_133_PRESENT    1
#else
    #define NRF52_ERRATA_133_PRESENT    0
#endif

#ifndef NRF52_ERRATA_133_ENABLE_WORKAROUND
    #define NRF52_ERRATA_133_ENABLE_WORKAROUND    NRF52_ERRATA_133_PRESENT
#endif

static bool nrf52_errata_133( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 134 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_134_PRESENT    1
#else
    #define NRF52_ERRATA_134_PRESENT    0
#endif

#ifndef NRF52_ERRATA_134_ENABLE_WORKAROUND
    #define NRF52_ERRATA_134_ENABLE_WORKAROUND    NRF52_ERRATA_134_PRESENT
#endif

static bool nrf52_errata_134( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

