FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52_erratas.h
#ifndef NRF52_ERRATA_164_ENABLE_WORKAROUND
    #define NRF52_ERRATA_164_ENABLE_WORKAROUND    NRF52_ERRATA_164_PRESENT
#endif

static bool nrf52_errata_164( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 166 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_166_PRESENT    1
#else
    #define NRF52_ERRATA_166_PRESENT    0
#endif

#ifndef NRF52_ERRATA_166_ENABLE_WORKAROUND
    #define NRF52_ERRATA_166_ENABLE_WORKAROUND    NRF52_ERRATA_166_PRESENT
#endif

static bool nrf52_errata_166( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 170 ========= */
#if    defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) \
    || defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 ) \
    || defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_170_PRESENT    1
#else
    #define NRF52_ERRATA_170_PRESENT    0
#endif

#ifndef NRF52_ERRATA_170_ENABLE_WORKAROUND
    #define NRF52_ERRATA_170_ENABLE_WORKAROUND    NRF52_ERRATA_170_PRESENT
#endif

static bool nrf52_errata_170( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) \
        || defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 )  \
        || defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        #if defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 )
            if( var1 == 0x0D )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 ) */
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
            if( var1 == 0x10 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 171 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_171_PRESENT    1
#else
    #define NRF52_ERRATA_171_PRESENT    0
#endif

#ifndef NRF52_ERRATA_171_ENABLE_WORKAROUND
    #define NRF52_ERRATA_171_ENABLE_WORKAROUND    NRF52_ERRATA_171_PRESENT
#endif

static bool nrf52_errata_171( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

