FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52_erratas.h
                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        #if defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 )
            if( var1 == 0x0A )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 ) */
        #if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
            if( var1 == 0x0E )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 214 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_214_PRESENT    1
#else
    #define NRF52_ERRATA_214_PRESENT    0
#endif

#ifndef NRF52_ERRATA_214_ENABLE_WORKAROUND
    #define NRF52_ERRATA_214_ENABLE_WORKAROUND    NRF52_ERRATA_214_PRESENT
#endif

static bool nrf52_errata_214( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 215 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_215_PRESENT    1
#else
    #define NRF52_ERRATA_215_PRESENT    0
#endif

#ifndef NRF52_ERRATA_215_ENABLE_WORKAROUND
    #define NRF52_ERRATA_215_ENABLE_WORKAROUND    NRF52_ERRATA_215_PRESENT
#endif

static bool nrf52_errata_215( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 216 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_216_PRESENT    1
#else
    #define NRF52_ERRATA_216_PRESENT    0
#endif

#ifndef NRF52_ERRATA_216_ENABLE_WORKAROUND
    #define NRF52_ERRATA_216_ENABLE_WORKAROUND    NRF52_ERRATA_216_PRESENT
#endif

static bool nrf52_errata_216( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return true;

                    case 0x05ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 217 ========= */
#if    defined( NRF52805_XXAA ) || defined( DEVELOP_IN_NRF52805 ) \
    || defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 ) \
    || defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
    #define NRF52_ERRATA_217_PRESENT    1
#else
    #define NRF52_ERRATA_217_PRESENT    0
#endif

#ifndef NRF52_ERRATA_217_ENABLE_WORKAROUND
    #define NRF52_ERRATA_217_ENABLE_WORKAROUND    NRF52_ERRATA_217_PRESENT
#endif

static bool nrf52_errata_217( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52805_XXAA ) || defined( DEVELOP_IN_NRF52805 ) \
        || defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 )  \
        || defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 )
            if( var1 == 0x0A )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return false;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 ) */
        #if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
            if( var1 == 0x0E )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 ) */
        #if defined( NRF52805_XXAA ) || defined( DEVELOP_IN_NRF52805 )
            if( var1 == 0x0F )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52805_XXAA ) || defined( DEVELOP_IN_NRF52805 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 218 ========= */
#if    defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) \
    || defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) \
    || defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 ) \
    || defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_218_PRESENT    1
#else
    #define NRF52_ERRATA_218_PRESENT    0
#endif

#ifndef NRF52_ERRATA_218_ENABLE_WORKAROUND
    #define NRF52_ERRATA_218_ENABLE_WORKAROUND    NRF52_ERRATA_218_PRESENT
#endif

static bool nrf52_errata_218( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )
            uint32_t var1;
            uint32_t var2;

            if( *( uint32_t * ) 0x10000130ul == 0xFFFFFFFF )
            {
                var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
                var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
            }
            else
            {
                var1 = *( uint32_t * ) 0x10000130ul;
                var2 = *( uint32_t * ) 0x10000134ul;
            }
        #elif defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) \
        || defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 )    \
        || defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif /* if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 ) */
        #if defined( NRF52832_XXAA ) || defined( DEVELOP_IN_NRF52832 ) \
        || defined( NRF52832_XXAB ) || defined( DEVELOP_IN_NRF52832 )

            if( var1 == 0x06 )
            {
                switch( var2 )
                {
                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

