FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52_erratas.h
                    case 0x03ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 230 ========= */
#if    defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
    #define NRF52_ERRATA_230_PRESENT    1
#else
    #define NRF52_ERRATA_230_PRESENT    0
#endif

#ifndef NRF52_ERRATA_230_ENABLE_WORKAROUND
    #define NRF52_ERRATA_230_ENABLE_WORKAROUND    NRF52_ERRATA_230_PRESENT
#endif

static bool nrf52_errata_230( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
            if( var1 == 0x10 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 231 ========= */
#if    defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
    #define NRF52_ERRATA_231_PRESENT    1
#else
    #define NRF52_ERRATA_231_PRESENT    0
#endif

#ifndef NRF52_ERRATA_231_ENABLE_WORKAROUND
    #define NRF52_ERRATA_231_ENABLE_WORKAROUND    NRF52_ERRATA_231_PRESENT
#endif

static bool nrf52_errata_231( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
            if( var1 == 0x10 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 232 ========= */
#if    defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 ) \
    || defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
    #define NRF52_ERRATA_232_PRESENT    1
#else
    #define NRF52_ERRATA_232_PRESENT    0
#endif

#ifndef NRF52_ERRATA_232_ENABLE_WORKAROUND
    #define NRF52_ERRATA_232_ENABLE_WORKAROUND    NRF52_ERRATA_232_PRESENT
#endif

static bool nrf52_errata_232( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 ) \
        || defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 )
            if( var1 == 0x0A )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return false;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF52810_XXAA ) || defined( DEVELOP_IN_NRF52810 ) */
        #if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
            if( var1 == 0x0E )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 233 ========= */
#if    defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) \
    || defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 ) \
    || defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_ERRATA_233_PRESENT    1
#else
    #define NRF52_ERRATA_233_PRESENT    0
#endif

#ifndef NRF52_ERRATA_233_ENABLE_WORKAROUND
    #define NRF52_ERRATA_233_ENABLE_WORKAROUND    NRF52_ERRATA_233_PRESENT
#endif

static bool nrf52_errata_233( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) \
        || defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 )  \
        || defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

