FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52_erratas.h
/* ========= Errata 254 ========= */
#if    defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
    #define NRF52_CONFIGURATION_254_PRESENT    1
#else
    #define NRF52_CONFIGURATION_254_PRESENT    0
#endif

#ifndef NRF52_CONFIGURATION_254_ENABLE
    #define NRF52_CONFIGURATION_254_ENABLE    NRF52_CONFIGURATION_254_PRESENT
#endif

static bool nrf52_configuration_254( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 )
            if( var1 == 0x08 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return false;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return false;

                    case 0x05ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52840_XXAA ) || defined( DEVELOP_IN_NRF52840 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 255 ========= */
#if    defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 )
    #define NRF52_CONFIGURATION_255_PRESENT    1
#else
    #define NRF52_CONFIGURATION_255_PRESENT    0
#endif

#ifndef NRF52_CONFIGURATION_255_ENABLE
    #define NRF52_CONFIGURATION_255_ENABLE    NRF52_CONFIGURATION_255_PRESENT
#endif

static bool nrf52_configuration_255( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 )
            if( var1 == 0x0D )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return false;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52833_XXAA ) || defined( DEVELOP_IN_NRF52833 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 256 ========= */
#if    defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
    #define NRF52_CONFIGURATION_256_PRESENT    1
#else
    #define NRF52_CONFIGURATION_256_PRESENT    0
#endif

#ifndef NRF52_CONFIGURATION_256_ENABLE
    #define NRF52_CONFIGURATION_256_ENABLE    NRF52_CONFIGURATION_256_PRESENT
#endif

static bool nrf52_configuration_256( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 )
            if( var1 == 0x10 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return false;

                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52820_XXAA ) || defined( DEVELOP_IN_NRF52820 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

/* ========= Errata 257 ========= */
#if    defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
    #define NRF52_CONFIGURATION_257_PRESENT    1
#else
    #define NRF52_CONFIGURATION_257_PRESENT    0
#endif

#ifndef NRF52_CONFIGURATION_257_ENABLE
    #define NRF52_CONFIGURATION_257_ENABLE    NRF52_CONFIGURATION_257_PRESENT
#endif

static bool nrf52_configuration_257( void )
{
    #ifndef NRF52_SERIES
        return false;
    #else
        #if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
            uint32_t var1 = *( uint32_t * ) 0x10000130ul;
            uint32_t var2 = *( uint32_t * ) 0x10000134ul;
        #endif
        #if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 )
            if( var1 == 0x0E )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return false;

                    case 0x01ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF52811_XXAA ) || defined( DEVELOP_IN_NRF52811 ) */
        return false;
    #endif /* ifndef NRF52_SERIES */
}

#endif /* NRF52_ERRATAS_H */
